### <font color='orange'> Markov Chains for PAR Account Transitions</font>

In [ ]:
import numpy as np
import random
import pandas as pd
from datetime import datetime

In [39]:
mydates = pd.Series(pd.date_range(start="2022-01-01",end="2022-12-31"))

random.seed(1)
my_segments = ['Agricultural','Blend','Commercial','GMS','Industrial','Microfinance','Other Personal','Salary Loan-HO','SME','Uploan']
my_segments2 = pd.Series(random.choices(my_segments,k=len(mydates)))

In [170]:
mynum = list(np.arange(1,5000000))
my_par = ['PAR0','PAR1','PAR2']

df1 = pd.DataFrame()
df1['ID'] = random.sample(mynum, k =3000000)
df1['state1'] = random.choices(my_par, k=3000000)

df2 = pd.DataFrame()
df2['ID'] = random.sample(mynum, k =3000000)
df2['state2'] = random.choices(my_par, k=3000000)

In [171]:
df3 = pd.merge(df1, df2, how='left', left_on='ID', right_on='ID')
df3.shape

(3000000, 3)

In [173]:
df3.head(3)

        ID state1 state2
0  1128258   PAR1   PAR0
1  2241400   PAR1    NaN
2  4290932   PAR1   PAR0

In [174]:
foo2 = pd.pivot_table(df3, index=['state1'], columns=['state2'], aggfunc='count', margins=True).reset_index()
foo2

       state1      ID
state2           PAR0    PAR1    PAR2      All
0        PAR0  199908  200218  200761   600887
1        PAR1  200009  199511  199999   599519
2        PAR2  199810  200082  199843   599735
3         All  599727  599811  600603  1800141

In [176]:
foo2 = pd.pivot_table(df3, index=['state1'], columns=['state2'], aggfunc='count', margins=True, fill_value=0)
foo3 = foo2.div(foo2.iloc[:,-1], axis=0)
foo3.reset_index()

       state1        ID
state2             PAR0      PAR1      PAR2  All
0        PAR0  0.332688  0.333204  0.334108  1.0
1        PAR1  0.333616  0.332785  0.333599  1.0
2        PAR2  0.333164  0.333617  0.333219  1.0
3         All  0.333156  0.333202  0.333642  1.0